Documents/Тренировка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>Тренировка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Тренировка</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Спортсмен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Спортсмен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЖурналТренировок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Упражнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Упражнение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Стиль</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Повторы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>19</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonForms/Главная/Ext/Form/Module.bsl
#Область ОписаниеПеременных
#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьФормуВосстановления();
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	ЗаполнитьФормуВосстановления();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	ЗаполнитьФормуВосстановления();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаймингОтдыха

&НаКлиенте
Процедура ТаймингОтдыхаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ТренировкаСсылка	= Элемент.ТекущиеДанные.ТренировкаСсылка;
		ПараметрыФормы 		= Новый Структура("Ключ", ТренировкаСсылка);
	
		ОткрытьФорму("Документ.Тренировка.Форма.ФормаДокумента", ПараметрыФормы);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ТренироватьНажатие(Элемент)
	
	ФормаТренировка 			= ПолучитьФорму("Документ.Тренировка.Форма.ФормаДокумента");
	ДанныеФормыФормаТренировка 	= ФормаТренировка.Объект;
	КрайнееФИОСсылка			= ТренироватьНажатиеНаСервере();
	
	ДанныеФормыФормаТренировка.Спортсмен = КрайнееФИОСсылка;
	
	ФормаТренировка.Открыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ТренироватьНажатиеНаСервере()
	
	КрайнееФИОСсылка = Документы.Тренировка.ПолучитьКрайнееФИО();
	Возврат КрайнееФИОСсылка;
	
КонецФункции

Процедура ЗаполнитьФормуВосстановления()

	КрайнееВремяВосстановления 	= Документы.Тренировка.ПолучитьКрайнееВремяВосстановления();

	ТЗ = ЭтаФорма.ТаймингОтдыха;
	ТЗ.Очистить();	

	ГруппаМышц = "";	
	Для Каждого Восстановление Из КрайнееВремяВосстановления Цикл
		Если ГруппаМышц <> Строка(Восстановление.ГруппаМышц) Тогда
			стрТЗ 				= ТЗ.Добавить();
			стрТЗ.Стиль 		= Строка(Восстановление.ГруппаМышц);
			стрТЗ.КакЗаголовок 	= Истина;
			ГруппаМышц 			= Строка(Восстановление.ГруппаМышц);
		КонецЕсли;
		
		стрТЗ = ТЗ.Добавить();		
		ЗаполнитьЗначенияСвойств(стрТЗ, Восстановление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ТренировкаЗаписать" Тогда 
		ЗаполнитьФормуВосстановления();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
